[
  {
    "id": 1,
    "title": "HTB: Keeper - Easy Linux Box",
    "description": "Comprehensive walkthrough of the Keeper machine from HackTheBox. Initial foothold gained through default credentials on Request Tracker installation, followed by KeePass database exploitation. Covers credential harvesting, KeePass vulnerability CVE-2023-32784, and SSH key extraction for root access.",
    "difficulty": "Easy",
    "platform": "HackTheBox",
    "category": "Linux",
    "tags": ["htb", "linux", "privesc", "webapp", "keepass", "cve"],
    "date": "2025-12-10",
    "slug": "htb-keeper",
    "featured": true
  },
  {
    "id": 2,
    "title": "TryHackMe: SQL Injection Deep Dive",
    "description": "Comprehensive guide covering advanced SQL injection techniques across MySQL, PostgreSQL, and MSSQL. Explores UNION-based attacks, Boolean blind SQLi with binary search optimization, time-based blind injection, second-order SQLi, and sqlmap automation. Includes database fingerprinting, privilege escalation via SQLi, and file system access techniques.",
    "difficulty": "Intermediate",
    "platform": "TryHackMe",
    "category": "Web",
    "tags": ["sqli", "webapp", "database", "mysql", "automation"],
    "date": "2025-11-25",
    "slug": "thm-sqli-deepdive",
    "featured": true
  },
  {
    "id": 3,
    "title": "PortSwigger: Advanced XSS Exploitation",
    "description": "Complete solutions for PortSwigger's XSS lab series covering reflected, stored, and DOM-based XSS. Demonstrates filter bypass techniques including polyglot payloads, context escaping, WAF evasion, CSP bypass methods, and mutation XSS. Includes exploiting XSS for session hijacking, CSRF token theft, and keylogging attacks.",
    "difficulty": "Intermediate",
    "platform": "PortSwigger",
    "category": "Web",
    "tags": ["xss", "webapp", "javascript", "bypass", "csp"],
    "date": "2025-10-30",
    "slug": "portswigger-xss-labs"
  },
  {
    "id": 4,
    "title": "HTB: Manager - Medium Active Directory",
    "description": "In-depth Active Directory penetration test walkthrough. Covers LDAP anonymous bind enumeration, AS-REP roasting for password cracking, Kerberoasting with targeted SPN analysis, lateral movement via SMB, and domain controller compromise. Demonstrates credential dumping with secretsdump, DCSync attack, and Golden Ticket generation for persistence.",
    "difficulty": "Medium",
    "platform": "HackTheBox",
    "category": "Active Directory",
    "tags": ["htb", "windows", "activedirectory", "kerberos", "lateral-movement"],
    "date": "2025-09-15",
    "slug": "htb-manager",
    "featured": true
  },
  {
    "id": 5,
    "title": "HTB: Sandworm - Hard Linux Container Escape",
    "description": "Advanced Linux exploitation featuring SSTI in Flask application for initial access, Rust binary exploitation for privilege escalation, and container escape via Firejail vulnerability CVE-2022-31214. Covers Jinja2 template injection, reverse engineering Rust binaries, and kernel exploitation techniques for full system compromise.",
    "difficulty": "Hard",
    "platform": "HackTheBox",
    "category": "Linux",
    "tags": ["htb", "linux", "ssti", "container-escape", "rust", "cve"],
    "date": "2025-08-20",
    "slug": "htb-sandworm"
  },
  {
    "id": 6,
    "title": "PortSwigger: SSRF to RCE Chain",
    "description": "Advanced exploitation chain demonstrating Server-Side Request Forgery to Remote Code Execution. Covers SSRF detection via out-of-band techniques, exploiting internal services (Redis, Memcached), cloud metadata API exploitation for AWS credential theft, and chaining SSRF with deserialization vulnerabilities for full system compromise.",
    "difficulty": "Hard",
    "platform": "PortSwigger",
    "category": "Web",
    "tags": ["ssrf", "rce", "webapp", "cloud", "deserialization"],
    "date": "2025-07-28",
    "slug": "portswigger-ssrf-rce"
  },
  {
    "id": 7,
    "title": "TryHackMe: Buffer Overflow Mastery",
    "description": "Complete guide to stack-based buffer overflow exploitation on Linux and Windows. Covers fuzzing, pattern creation for offset calculation, bad character identification, JMP ESP gadget location, ASLR/DEP bypass techniques using ROP chains, and shellcode development. Includes exploitation of real-world vulnerable applications with detailed debugging sessions.",
    "difficulty": "Hard",
    "platform": "TryHackMe",
    "category": "Binary Exploitation",
    "tags": ["bof", "exploit-dev", "assembly", "rop", "shellcode"],
    "date": "2025-06-15",
    "slug": "thm-buffer-overflow"
  },
  {
    "id": 8,
    "title": "HTB: Authority - Medium Windows AD",
    "description": "Windows Active Directory exploitation focusing on ADCS (Active Directory Certificate Services) attacks. Demonstrates certificate template misconfiguration abuse, ESC1 vulnerability exploitation, PFX certificate generation for user impersonation, and domain escalation via certificate-based authentication. Includes PowerShell empire deployment and persistence mechanisms.",
    "difficulty": "Medium",
    "platform": "HackTheBox",
    "category": "Active Directory",
    "tags": ["htb", "windows", "adcs", "certificates", "activedirectory"],
    "date": "2025-05-22",
    "slug": "htb-authority"
  }
]
